# inline 函数

# 内联汇编

# 虚函数怎么实现、虚函数有几个虚函数表指针

# 虚析构函数

# 智能指针

# signal_slot 机制

# 观察者模式

# 函数调用过程中栈的切换

# std::move

# 断言、异常、错误码

#define 和 const

# 指针和引用

# 四种转换类型

# 重载

# 深拷贝、浅拷贝

# extern c

# volatile

# 内存泄漏的集中情况

# 栈溢出的原因以及解决办法

# 友元函数以及友元类

# struct和Union的区别

# new delete malloc free

# delete[] 和delete

# 定义和声明的区别

# 静态绑定和动态绑定

# bind

# lambuda

# 纯虚函数

# debug版本和release版本

# 枚举类型

# assert

# 虚析构函数

# try catch

# 匿名命名空间

# 子类析构会调用父类的析构函数嘛

# 什么情况下需要使用常引用

# over和override的区别

# 有哪几种情况只能用 intialization list 而不能用 assignment ?

# C++ 是不是类型安全的？

# 基类的析构函数不是虚函数，会带来什么问题

# 编写类 String 的构造函数，析构函数，拷贝构造函数和赋值函数

# 不调用 C/C++ 的字符串库函数，编写 strcpy

# 什么时候要用虚析构函数

# C++ 怎样让返回对象的函数不调用拷贝构造函数

# 什么是消息映射?

# 局部变量和全局变量是否可以同名?

# 继承的优缺点

# const char *p和char * const p; 的区别

# 多线程同步和互斥有何异同，在什么情况下分别使用他们？举例说明。

# 多线程中栈与堆是公有的还是私有的

# 在Windows编程中互斥量与临界区比较类似，请分析一下二者的主要区别。

# 子线程循环 10 次，接着主线程循环 100 次，接着又回到子线程循环 10 次，接着再回到主线程又循环 100 次，如此循环50次，试写出代码。

# 生产者消费者问题

# 读者写者问题

# Linux 线程同步的三种方法

# epoll select  poll

# 将程序跳转到指定内存地址

# 内存的分配方式有几种?

# 、计算机内部如何存储负数和浮点数？

# 左值和右值

# 什么是内存泄漏？面对内存泄漏和指针越界，你有哪些方法？你通常采用哪些方法来避免和减少这类错误

# 从汇编层去解释一下引用

#  形参与实参的区别？

#  int fun() 和 int fun(void)的区别?

# 用C语言实现C++的继承

# malloc与free的实现原理？

# 构造函数析构函数可否抛出异常

# STL vector的实现，删除其中的元素，迭代器如何变化？为什么是两倍扩容？释放空间？

# ​​​​​​​STL迭代器如何实现

# 野指针是什么？如何检测内存泄漏？

# 手写实现智能指针类。

# C++的内存管理

# 引用是否能实现动态绑定，为什么引用可以实现

# C++中的基本数据类型及派生类型

# 友元函数和友元类

# c++函数库<algorithm>中一些实用的函数

# 宏定义的作用是什么？

# inline 内联函数的特点有哪些？它的优缺点是什么

# 如何计算结构体长度？

# 知道条件变量吗？条件变量为什么要和锁配合使用？

# memcpy怎么实现让它效率更高？

# 了解RAII吗？介绍一下？RAII可是C++很重要的一个特性。

#  struct和class有什么区别？

# 如果虚函数是有效的，那为什么不把所有函数设为虚函数？

# 构造函数可以是虚函数吗？析构函数可以是虚函数吗？

# malloc的内存可以用delete释放吗？

# new[]和delete[]一定要配对使用吗？为什么？

# 如何实现一个线程池？说一下基本思路即可！

# 了解各种强制类型转换的原理及使用吗？说说？

# 类的大小怎么计算？

# 了解auto和decltype吗？

# 谈一谈你对左值和右值的了解，了解左值引用和右值引用吗？

# enum 和 enum class有什么区别？

# 了解移动语义和完美转发吗？

# 平时会用到function、bind、lambda吗，都什么场景下会用到？

# unique_ptr如何转换的所有权？

# deque的底层数据结构是什么？它的内部是怎么实现的？

# 分别写出饿汉和懒汉线程安全的单例模式

# 说出观察者模式类关系和优点

# 说出代理模式类关系和优点

# 出工厂模式概念和优点

# 说出适配器模式概念

# 说出构造者模式概念

# 虚拟内存是如何映射到物理内存的？了解分页内存管理吗？

# 什么是大端字节，什么是小端字节？如何转换字节序？

# 信号和信号量的区别是什么？

# this 指针

# using

# C++中的锁有哪些，你用过哪些

# linux段错误如何调试？

# TCP 的粘包问题

# ++匿名函数有没有地址

# 智能指针存在相互引用的问题，如何解决

# gcc 和 g++的区别

# 
